Revit 2024 API
View.CanUseTemporaryVisibilityModes Method
 Indicates if view can use temporary visibility modes
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2013
Syntax
C#
public bool CanUseTemporaryVisibilityModes()
Visual Basic
Public Function CanUseTemporaryVisibilityModes As Boolean
Visual C++
public:
bool CanUseTemporaryVisibilityModes()
Return Value
 True if view can use temporary visibility modes
See Also
View Class
Autodesk.Revit.DB Namespace